Repository: knshk2323/Travel_diary
Catalog: lib/l10n/app_*.arb
Languages: kk, ru

# aboutTitle
source: About
kk: Қосымша туралы
ru: О приложении

# appDescription
source: Your personal travel companion
kk: Travel Diary — бұл пайдаланушыларға сапарларын сипаттап, фотосуреттер қоса отырып жазуға мүмкіндік беретін мобильді қосымша. Ол естеліктерді сақтау, саяхаттарды құжаттау және әсерлермен бөлісуге көмектеседі.
ru: Travel Diary — это мобильное приложение, которое позволяет пользователям записывать свои поездки с описаниями и прикреплять фотографии. Оно помогает сохранять воспоминания, документировать путешествия и делиться впечатлениями.

# creditsTitle
source: Credits
kk: Авторлар
ru: Авторы

# developers
source: Developed by Diana Kumarbekova, Kunshuak Asset, Magzhan Kydyrbek in the scope of the course "Cross-platform Development" at Astana IT University.
kk: Қосымша Astana IT University-де өткен "Кросс-платформалық даму" курсы аясында Диана Кұмарбекова, Күншуақ Әсет және Мағжан Қыдырбек тарапынан жасалды.
ru: Разработано Дианой Кумарбековой, Куншуаком Ассетом и Магжаном Кыдырбеком в рамках курса "Кроссплатформенная разработка" в Astana IT University.

# mentor
source: Mentor (Teacher): Assistant Professor Abzal Kyzyrkanov
kk: Жетекші (оқытушы): Доцент Абзал Қызырқанов
ru: Наставник (преподаватель): Доцент Абзал Кызырканов

# homePageTitle
source: Our Trips
kk: Біздің сапарлар
ru: Наши поездки

# addTrip
source: Add a Trip
kk: Сапар қосу
ru: Добавить поездку

# newTripTitle
source: New Trip
kk: Жаңа сапар
ru: Новая поездка

# newTripDescription
source: Description of a new trip.
kk: Жаңа сапардың сипаттамасы.
ru: Описание новой поездки.

source: Info
kk: Ақпарат
ru: Информация

# settingsTitle
source: Settings
kk: Параметрлер
ru: Настройки

source: Show Developer Info
kk: Әзірлеуші туралы ақпаратты көрсету
ru: Показать информацию о разработчике

source: Current Language
kk: Қазіргі тіл
ru: Текущий язык

# homeTitle
source: My Trips
kk: Сапар жоспарлаушы
ru: Планировщик поездок

source: Trip deleted
kk: жойылды.
ru: был удален

source: Undo
kk: Болдырмау
ru: Отменить
